# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters 参数区
nc: 80 # number of classes 类别数
# 模型深度倍数含义：模型深度倍数是指模型的深度相对于原始模型的倍数，比如原始模型有3个卷积层，那么模型深度倍数为0.5的话，那么新的模型就有1.5个卷积层
# 层通道倍数含义：层通道倍数是指模型的通道数相对于原始模型的倍数，比如原始模型有3个卷积层，每个卷积层的通道数分别为[64, 128, 256]，
# 那么层通道倍数为0.5的话，那么新的模型的每个卷积层的通道数分别为[32, 64, 128]
depth_multiple: 0.33 # model depth multiple 模型深度倍数
width_multiple: 0.50 # layer channel multiple 层通道倍数

#锚点 
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8 每一层定义了三个锚点 分别是 [10*13] [16*30] [33*23]
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args] 分别表示了输入层的来历（-1就表示上一层），卷积层的数量，层的类型，层的参数
  # 层的参数有很多种，比如卷积层的参数是[channels, kernel_size, stride, pad]，C3层的参数是[channels]
  # 可以在common.py中找到这些层的定义，以及层的参数
  [
    #这个backbone是由一系列的卷积层和C3层组成的 
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2 图片经过特征提取后的尺寸是原图的1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32 图片经过特征提取后的尺寸是原图的1/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

#所有的图片都会经过这个backbone 从而得到三个不同尺度的特征图 P代表的是金字塔中的层数
#然后这三个特征图会被送入head部分 进行检测 也就是说backbone是用来提取特征的 head是用来检测的

# YOLOv5 v6.0 head
head: [
    #这个head是由一系列的卷积层和C3层组成的
    [-1, 1, Conv, [512, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 6], 1, Concat, [1]], # cat backbone P4 #这个的意思是将上一层和第6层的特征图进行拼接
    [-1, 3, C3, [512, False]], # 13

    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 4], 1, Concat, [1]], # cat backbone P3 #这个的意思是将上一层和第4层的特征图进行拼接
    [-1, 3, C3, [256, False]], # 17 (P3/8-small) 负责检测小目标

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 14], 1, Concat, [1]], # cat head P4 #这个的意思是将上一层和第14层的特征图进行拼接
    [-1, 3, C3, [512, False]], # 20 (P4/16-medium) 负责检测中目标

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 10], 1, Concat, [1]], # cat head P5 #这个的意思是将上一层和第10层的特征图进行拼接
    [-1, 3, C3, [1024, False]], # 23 (P5/32-large) 负责检测大目标

    [[17, 20, 23], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5) 检测
  ]
